Revit 2027 API
BuiltInFailures.EditingFailures.OwnedByOther Property
 Can't edit the element until '[Partition Name]' resaves the element to central and relinquishes it and you Reload Latest.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OwnedByOther { get; }
Public Shared ReadOnly Property OwnedByOther As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OwnedByOther {
	FailureDefinitionId^ get ();
}
static member OwnedByOther : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace